"""
Вопрос №1

На языке Python написать алгоритм (функцию) определения четности целого числа, который будет аналогичен нижеприведенному
по функциональности, но отличен по своей сути. Объяснить плюсы и минусы обеих реализаций.

Пример:

def isEven(value):

      return value % 2 == 0
"""


def isEvenNew(value):
    return value & 1 == 0


"""
Функция представленная в примере проще для понимания, однако работает медленне написанной функции, т.к. последняя
работает на более низкоуровневых процессорных операциях.
"""
